Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateGreaterRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
are greater than a certain value.
Remarks:
For strings, a value is "greater" than another if it would appear after
the other in an alphabetically-sorted list.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value against which values from the document will be compared.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateNotEqualsRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
do not equal a certain value.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value against which values from the document will be compared.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011

Autodesk.Revit.DB.ParameterFilterRuleFactory.CreateEqualsRule(Autodesk.Revit.DB.ElementId,System.String,System.Boolean)
Creates a filter rule that determines whether strings from the document
equal a certain value.
parameter:
A string-typed parameter used to get values from the document for a given element.
value:
The user-supplied string value against which values from the document will be compared.
caseSensitive:
If true, the string comparison will be case-sensitive.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011